AV/FO/INTERSPEC_interfaces_SAP/Exp2Sap/Exp2Sap-example-UpdateCreateInstruction-xml.txt

<soap:Envelope xmlns:xsl="http://www.w3.org/2001/XMLSchema-instance" xmlns:xsd="http://www.w3.org/2001/XMLSchema" xmlns:soap="http://schemas.xmlsoap.org/soap/envelope/">
  <soap:Body>
    <UpdateOrCreateInstructions xmlns="http://apollovredestein.com/interspec_sap">
      <SequenceNr>243020</SequenceNr>
      <Plant>5M01</Plant>
      <Article>E1LV568</Article>
      <ProcessingGroups>
        <ProcessingGroup>
          <GroupName>QUADR</GroupName>
          <Lines>
            <Line>
              <InstructionType>P</InstructionType>
              <LineNr>10</LineNr>
              <LineText>HOOFDAFMETINGEN:</LineText>
            </Line>
            <Line>
              <InstructionType>P</InstructionType>
              <LineNr>20</LineNr>
              <LineText>TOTAALBREEDTE [mm]   = 262   (TOLERANTIES: -3,5/ 3,5)</LineText>
            </Line>
            <Line>
              <InstructionType>P</InstructionType>
              <LineNr>30</LineNr>
              <LineText>SCHOUDERBREEDTE [mm] = 228   (TOLERANTIES: -3,0/3,0)</LineText>
            </Line>
            <Line>
              <InstructionType>P</InstructionType>
              <LineNr>40</LineNr>
              <LineText>GEWICHT [kg]         = 2,101 (TOLERANTIES: 1,954/2,248)</LineText>
            </Line>
            <Line>
              <InstructionType>P</InstructionType>
              <LineNr>50</LineNr>
              <LineText>VOOR DIKTES ZIE INTERSPEC</LineText>
            </Line>
            <Line>
              <InstructionType>P</InstructionType>
              <LineNr>60</LineNr>
              <LineText/>
            </Line>
            <Line>
              <InstructionType>P</InstructionType>
              <LineNr>70</LineNr>
              <LineText>TOLERANTIES [mm]     = -10/10</LineText>
            </Line>
            <Line>
              <InstructionType>P</InstructionType>
              <LineNr>80</LineNr>
              <LineText>                       NIET SLINGEREN OF IN GROEF</LineText>
            </Line>
            <Line>
              <InstructionType>P</InstructionType>
              <LineNr>90</LineNr>
              <LineText/>
            </Line>
            <Line>
              <InstructionType>P</InstructionType>
              <LineNr>100</LineNr>
              <LineText>MAATKODE             = TUSSEN 40 EN 60 MM UIT CENTER STEMPELEN</LineText>
            </Line>
            <Line>
              <InstructionType>S</InstructionType>
              <LineNr>10</LineNr>
              <LineText>RECEPT : DQ267               </LineText>
            </Line>
          </Lines>
        </ProcessingGroup>
      </ProcessingGroups>
    </UpdateOrCreateInstructions>
  </soap:Body>
</soap:Envelope>